None of the segment references of this Arc Length Dimension intersects the bounded arc of the arc reference.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ArcLengthDimensionNoReferencesOnArc { get; }
  Visual Basic
Public Shared ReadOnly Property ArcLengthDimensionNoReferencesOnArc As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ArcLengthDimensionNoReferencesOnArc {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DimensionFailures Class
  Autodesk.Revit.DB Namespace